RT-Thread/rt-thread/bsp/gd32450z-eval/Libraries/GD32F4xx_usb_driver/Include/usb_regs.h
/* device IN endpoint x control register bits definitions */
#define DIEPCTL_EPEN              BIT(31)             /*!< endpoint enable */
#define DIEPCTL_EPD               BIT(30)             /*!< endpoint disable */
#define DIEPCTL_SODDFRM           BIT(29)             /*!< set odd frame */
#define DIEPCTL_SD1PID            BIT(29)             /*!< set DATA1 PID */
#define DIEPCTL_SEVNFRM           BIT(28)             /*!< set even frame */
#define DIEPCTL_SD0PID            BIT(28)             /*!< set DATA0 PID */
#define DIEPCTL_SNAK              BIT(27)             /*!< set NAK */
#define DIEPCTL_CNAK              BIT(26)             /*!< clear NAK */
#define DIEPCTL_TXFNUM            BITS(22, 25)        /*!< tx FIFO number */
#define DIEPCTL_STALL             BIT(21)             /*!< STALL handshake */
#define DIEPCTL_EPTYPE            BITS(18, 19)        /*!< endpoint type */
#define DIEPCTL_NAKS              BIT(17)             /*!< NAK status */
#define DIEPCTL_EOFRM             BIT(16)             /*!< even/odd frame */
#define DIEPCTL_DPID              BIT(16)             /*!< endpoint data PID */
#define DIEPCTL_EPACT             BIT(15)             /*!< endpoint active */
#define DIEPCTL_MPL               BITS(0, 10)         /*!< maximum packet length */

/* device OUT endpoint 0 control register bits definitions */
#define DOEP0CTL_EPEN             BIT(31)             /*!< endpoint enable */
#define DOEP0CTL_EPD              BIT(30)             /*!< endpoint disable */
#define DOEP0CTL_SNAK             BIT(27)             /*!< set NAK */
#define DOEP0CTL_CNAK             BIT(26)             /*!< clear NAK */
#define DOEP0CTL_STALL            BIT(21)             /*!< STALL handshake */
#define DOEP0CTL_SNOOP            BIT(20)             /*!< snoop mode */
#define DOEP0CTL_EPTYPE           BITS(18, 19)        /*!< endpoint type */
#define DOEP0CTL_NAKS             BIT(17)             /*!< NAK status */
#define DOEP0CTL_EPACT            BIT(15)             /*!< endpoint active */
#define DOEP0CTL_MPL              BITS(0, 1)          /*!< maximum packet length */

/* device OUT endpoint-x control register bits definitions */
#define DOEPCTL_EPEN              BIT(31)             /*!< endpoint enable */
#define DOEPCTL_EPD               BIT(30)             /*!< endpoint disable */
#define DOEPCTL_SODDFRM           BIT(29)             /*!< set odd frame */
#define DOEPCTL_SD1PID            BIT(29)             /*!< set DATA1 PID */
#define DOEPCTL_SEVNFRM           BIT(28)             /*!< set even frame */
#define DOEPCTL_SD0PID            BIT(28)             /*!< set DATA0 PID */
#define DOEPCTL_SNAK              BIT(27)             /*!< set NAK */
#define DOEPCTL_CNAK              BIT(26)             /*!< clear NAK */
#define DOEPCTL_STALL             BIT(21)             /*!< STALL handshake */
#define DOEPCTL_SNOOP             BIT(20)             /*!< snoop mode */
#define DOEPCTL_EPTYPE            BITS(18, 19)        /*!< endpoint type */
#define DOEPCTL_NAKS              BIT(17)             /*!< NAK status */
#define DOEPCTL_EOFRM             BIT(16)             /*!< even/odd frame */
#define DOEPCTL_DPID              BIT(16)             /*!< endpoint data PID */
#define DOEPCTL_EPACT             BIT(15)             /*!< endpoint active */
#define DOEPCTL_MPL               BITS(0, 10)         /*!< maximum packet length */

/* device IN endpoint-x interrupt flag register bits definitions */
#define DIEPINTF_NAK              BIT(13)             /*!< NAK handshake sent by USBHS */
#define DIEPINTF_TXFE             BIT(7)              /*!< transmit FIFO empty */
#define DIEPINTF_IEPNE            BIT(6)              /*!< IN endpoint NAK effective */
#define DIEPINTF_EPTXFUD          BIT(4)              /*!< endpoint Tx FIFO underrun */
#define DIEPINTF_CITO             BIT(3)              /*!< control In Timeout interrupt */
#define DIEPINTF_EPDIS            BIT(1)              /*!< endpoint disabled */
#define DIEPINTF_TF               BIT(0)              /*!< transfer finished */

/* device OUT endpoint-x interrupt flag register bits definitions */
#define DOEPINTF_NYET             BIT(14)             /*!< NYET handshake is sent */
#define DOEPINTF_BTBSTP           BIT(6)              /*!< back-to-back SETUP packets */
#define DOEPINTF_EPRXFOVR         BIT(4)              /*!< endpoint Rx FIFO overrun */
#define DOEPINTF_STPF             BIT(3)              /*!< SETUP phase finished */
#define DOEPINTF_EPDIS            BIT(1)              /*!< endpoint disabled */
#define DOEPINTF_TF               BIT(0)              /*!< transfer finished */

/* device IN endpoint 0 transfer length register bits definitions */
#define DIEP0LEN_PCNT             BITS(19, 20)        /*!< packet count */
#define DIEP0LEN_TLEN             BITS(0, 6)          /*!< transfer length */

/* device OUT endpoint 0 transfer length register bits definitions */
#define DOEP0LEN_STPCNT           BITS(29, 30)        /*!< SETUP packet count */
#define DOEP0LEN_PCNT             BIT(19)             /*!< packet count */
#define DOEP0LEN_TLEN             BITS(0, 6)          /*!< transfer length */

/* device IN endpoint-x transfer length register bits definitions */
#define DIEPLEN_MCNT              BITS(29, 30)        /*!< multi count */
#define DIEPLEN_PCNT              BITS(19, 28)        /*!< packet count */
#define DIEPLEN_TLEN              BITS(0, 18)         /*!< transfer length */

/* device OUT endpoint-x transfer length register bits definitions */
#define DOEPLEN_RXDPID            BITS(29, 30)        /*!< received data PID */
#define DOEPLEN_STPCNT            BITS(29, 30)        /*!< SETUP packet count */
#define DOEPLEN_PCNT              BITS(19, 28)        /*!< packet count */
#define DOEPLEN_TLEN              BITS(0, 18)         /*!< transfer length */

/* device IN endpoint-x DMA address register bits definitions */
#define DIEPDMAADDR_DMAADDR       BITS(0, 31)         /*!< DMA address */

/* device OUT endpoint-x DMA address register bits definitions */
#define DOEPDMAADDR_DMAADDR       BITS(0, 31)         /*!< DMA address */

